          01  PROFILO.                                                   
			   02 NOME-PROFILO  PIC X(8).       
			   02 LOG-MESSAGE   PIC S9(8).
               02 AUT-READ      PIC S9(8).
               02 AUT-UPDATE    PIC S9(8).